cf_billing/InformationRegisters/УдалитьэнргНомераПломбНаличиеПломбМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УдалитьэнргНомераПломбНаличиеПломбМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Опломбирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеПриборовМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеПриборовМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/УдалитьэнргНомераПломбНаличиеПломбМКД/Ext/ManagerModule.bsl
#Область РеализацияИнтерфейса_

Процедура ОпломбированныеПриборыУчета(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт  
	
	ПредыдущееИмяТаблицы 	= "ВведенныеПриборыДействующихТочек";
	ИспользоватьУзлыМКД		= энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД();
	
	Если Схема = Неопределено Тогда
		 ПолучитьСхемуАктивныхПриборовУчета(Схема, ПараметрыОтбора, ПредыдущееИмяТаблицы, ИспользоватьУзлыМКД);
	Иначе
		ЕстьДействующиеПриборыУчетаПомещения 		= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = ПредыдущееИмяТаблицы Тогда
				ЕстьДействующиеПриборыУчетаПомещения = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьДействующиеПриборыУчетаПомещения Тогда
			 ПолучитьСхемуАктивныхПриборовУчета(Схема, ПараметрыОтбора, ПредыдущееИмяТаблицы, ИспользоватьУзлыМКД);
		КонецЕсли; 		 		
	КонецЕсли;
		    		
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОпломбированныеПриборыУчета(ИспользоватьУзлыМКД));
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;	
	ПараметрПериод 						= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		Отбор 							= ОператорВыбора.Отбор;		
		ДоступныеПараметры 				= "Организация, Район, МКД, ПриборУчета";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;
	
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьСхемуАктивныхПриборовУчета(Схема, Параметры, ПредыдущееИмяТаблицы, ИспользоватьУзлыМКД)
	Если ИспользоватьУзлыМКД Тогда
		РегистрыСведений.энргСостояниеПриборовМКД.ДействующиеПриборыУчетаМКД(Схема, Параметры, ПредыдущееИмяТаблицы);
	Иначе
		РегистрыСведений.энргСостояниеПриборовМКД.АктивныеПриборыУчетаМКД(Схема, Параметры, ПредыдущееИмяТаблицы); 		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Функция ТекстЗапросаОпломбированныеПриборыУчета(ИспользоватьУзлыМКД)	
	Если ИспользоватьУзлыМКД Тогда
		Возврат ТекстЗапросаОпломбированныеПриборыУчетаСУзлом();
	Иначе		
		Возврат ТекстЗапросаОпломбированныеПриборыУчетаБезУзла();
	КонецЕсли; 	
КонецФункции

Функция ТекстЗапросаОпломбированныеПриборыУчетаБезУзла()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргНомераПломбНаличиеПломбМКДСрезПоследних.Организация КАК Организация,
	|	энргНомераПломбНаличиеПломбМКДСрезПоследних.Район КАК Район,
	|	энргНомераПломбНаличиеПломбМКДСрезПоследних.МКД КАК МКД,
	|	энргНомераПломбНаличиеПломбМКДСрезПоследних.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	РегистрСведений.УдалитьэнргНомераПломбНаличиеПломбМКД.СрезПоследних(
	|			,
	|			(Организация, Район, МКД, ПриборУчета) В
	|				(ВЫБРАТЬ
	|					ВведенныеПриборыДействующихТочек.Организация,
	|					ВведенныеПриборыДействующихТочек.Район,
	|					ВведенныеПриборыДействующихТочек.МКД,
	|					ВведенныеПриборыДействующихТочек.ПриборУчета
	|				ИЗ
	|					ВведенныеПриборыДействующихТочек КАК ВведенныеПриборыДействующихТочек)) КАК энргНомераПломбНаличиеПломбМКДСрезПоследних
	|ГДЕ
	|	энргНомераПломбНаличиеПломбМКДСрезПоследних.Опломбирован";
	
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаОпломбированныеПриборыУчетаСУзлом()
	
	Текст  =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргНомераПломбНаличиеПломбМКДСрезПоследних.Организация КАК Организация,
	|		энргНомераПломбНаличиеПломбМКДСрезПоследних.Район КАК Район,
	|		энргНомераПломбНаличиеПломбМКДСрезПоследних.МКД КАК МКД,
	|		энргНомераПломбНаличиеПломбМКДСрезПоследних.ПриборУчета КАК ПриборУчета
	|	ИЗ
	|		РегистрСведений.УдалитьэнргНомераПломбНаличиеПломбМКД.СрезПоследних(
	|				,
	|				(Организация, Район, МКД, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ВведенныеПриборыДействующихТочек.Организация,
	|						ВведенныеПриборыДействующихТочек.Район,
	|						ВведенныеПриборыДействующихТочек.МКД,
	|						ВведенныеПриборыДействующихТочек.ПриборУчета
	|					ИЗ
	|						ВведенныеПриборыДействующихТочек КАК ВведенныеПриборыДействующихТочек)) КАК энргНомераПломбНаличиеПломбМКДСрезПоследних
	|	ГДЕ
	|		энргНомераПломбНаличиеПломбМКДСрезПоследних.Опломбирован
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргНомераПломбНаличиеПломбМКДСрезПоследних.Организация,
	|		энргНомераПломбНаличиеПломбМКДСрезПоследних.Район,
	|		энргНомераПломбНаличиеПломбМКДСрезПоследних.МКД,
	|		энргНомераПломбНаличиеПломбМКДСрезПоследних.ПриборУчета
	|	ИЗ
	|		РегистрСведений.УдалитьэнргНомераПломбНаличиеПломбМКД.СрезПоследних(
	|				,
	|				(Организация, Район, МКД, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ВведенныеПриборыДействующихТочек.Организация,
	|						ВведенныеПриборыДействующихТочек.Район,
	|						ВведенныеПриборыДействующихТочек.МКД,
	|						ВведенныеПриборыДействующихТочек.ПриборУчета
	|					ИЗ
	|						ВведенныеПриборыДействующихТочек КАК ВведенныеПриборыДействующихТочек)) КАК энргНомераПломбНаличиеПломбМКДСрезПоследних
	|	ГДЕ
	|		энргНомераПломбНаличиеПломбМКДСрезПоследних.Опломбирован) КАК ВложенныйЗапрос";
	
	Возврат Текст;
КонецФункции

#КонецОбласти
